{
  "title": "Jabran Rafique",
  "contact": [
    "hello@jabran.me",
    "07983580025"
  ],
  "social": [
    {
      "text": "jabran.me",
      "link": "https://jabran.me"
    },
    {
      "text": "<span>github.com/</span>jabranr",
      "link": "https://github.com/jabranr"
    },
    {
      "text": "<span>twitter.com/</span>jabranr",
      "link": "https://twitter.com/jabranr"
    },
    {
      "text": "<span>linkedin.com/</span>jabranr",
      "link": "https://jabranr.me/linkedin"
    }
  ],
  "intro": "<span class=\"print:hidden\">I am a software engineer with a passion for the web. I have an experience of more than eight years in developing scalable, performant, and interactive web applications with a keen eye for best practices and industry standards.</span><span class=\"hidden print:block print:my-4\">I am a seasoned software engineer with over eight years of experience in developing scalable, performant, and interactive web applications. My passion for the web extends to a commitment to best practices and industry standards. I thrive on driving technology adoption, leading strategic initiatives, and mentoring cross-disciplinary teams.</span>",
  "employments": [
    {
      "order": 1,
      "role": "Staff Engineer",
      "duration": "Jan 2023 — Present",
      "employer": "Rated People",
      "website": "ratedpeople.com",
      "intro": "As a Staff Engineer, I inherited a majority of responsibilities from my previous Tech Lead role and expand to encompass broader responsibilities such as strategic planning, and technical directions.",
      "experience": [
        "Spearheading strategic planning and technical directions.",
        "Leading migration of legacy web apps to modern Frontend tech (ReactJS, NodeJS).",
        "Overseeing CI/CD pipelines using tools such as BitBucket, Bamboo, AWS, and Cloudflare.",
        "Driving performance improvements with tools like Lighthouse and WebPageTest.",
        "Providing technical leadership, strategic guidance, and mentorship to foster a culture of learning and growth.",
        "Collaborating with cross-functional teams to drive technical decisions aligning with long-term business goals."
      ]
    },
    {
      "order": 2,
      "role": "Frontend Tech Lead",
      "duration": "Jun 2018 — Dec 2022",
      "employer": "Rated People",
      "website": "ratedpeople.com",
      "intro": "As a Frontend Tech Lead, I was adept at mentoring and managing teams, driving modernization efforts, and ensuring code quality and platform health.",
      "experience": [
        "Managed and mentored Frontend development teams.",
        "Drove modernization efforts, ensuring code quality and platform health.",
        "Led migration from legacy PHP stack to modern tech (ReactJS, NodeJS, Remix).",
        "Monitored platform health using tools such as AppDynamics and Heap.",
        "Participated in recruitment efforts to build a high-performing engineering team.",
        "Contributed to user testing and AB testing initiatives using tools like Cloudflare Workers, VWO, and SEOClarity."
      ]
    },
    {
      "order": 3,
      "role": "Frontend Web Developer",
      "duration": "Nov 2015 — May 2018",
      "employer": "Rated People",
      "website": "ratedpeople.com",
      "intro": "Involved in planning and development of new features and maintaining the existing codebases by keeping up with best practices, performance, security and industry standards.",
      "experience": [
        "Contributed to Frontend stack migration to AWS.",
        "Played a key role in the platform rebrand in 2016.",
        "Upgraded Frontend tools chain and modernized the stack.",
        "Developed Symfony app for automated customer signups flow.",
        "Utilized NodeJS, ReactJS, and other modern tools for REST API development."
      ]
    },
    {
      "order": 4,
      "role": "Lead Web Developer",
      "duration": "Feb 2013 — Oct 2015",
      "employer": "Influence Digital",
      "website": "influence.digital",
      "intro": "Oversee the social apps and websites development for clients, mentor and manage the development team and maintain technical roadmap.",
      "experience": [
        "Oversaw social apps and websites development for various clients.",
        "Managed development cycles, timelines, and roadmaps.",
        "Mentored junior developers and freelancers.",
        "Developed and maintained LAMPHP stack-based MVC framework."
      ]
    }
  ],
  "freelancing": [
    {
      "order": 1,
      "role": "Developer",
      "duration": "Sep 2013 — Aug 2014",
      "employer": "Multinet",
      "website": "multinet.com.pk",
      "description": "I developed a Role-Based Access Control (RBAC) platform in LAM(PHP) stack to monitor countrywide fibre-optic operations internally. The monitoring platform extensively used Google Maps API underneath with drawings API on top of it to add lines and station data to showcase service status in real-time. The source of data was the emails generated by the stations on service updates."
    },
    {
      "order": 2,
      "role": "Developer",
      "duration": "May 2012 — Aug 2012",
      "employer": "JMK Logistics",
      "website": "jmklogistics.com",
      "description": "I developed the website, designed branding and an internal logistics consignment system using LAM(PHP) stack that had helped me learn advance aspects of web development."
    },
    {
      "order": 3,
      "role": "Developer",
      "duration": "Feb 2011 — Jan 2012",
      "employer": "Aerologic Limited",
      "website": "aerologic-ltd.com",
      "description": "I designed the wireframes and prototypes. Based on these designs, I developed the website and inventory UI for electro-mechanical material related to the aerospace industry using open-source technologies LAM(PHP)."
    }
  ],
  "projects": {
    "description": "I develop apps based on personal ideas and interests in my spare time. Most of my projects are open-sourced and the code is hosted at GitHub. Some of these projects are:",
    "data": [
      {
        "name": "Reason to Follow",
        "website": "reasontofollow.com",
        "description": "A browser extension for remembering reasons to follow accounts on social platforms."
      },
      {
        "name": "Childcare Vouchers",
        "website": "childcare-vouchers.uk",
        "description": "A directory of businesses accepting childcare vouchers as payment."
      },
      {
        "name": "Guess Where",
        "website": "guess-where.pages.dev",
        "description": "A geo quiz app built with HTML, CSS, JavaScript, and Google Maps API."
      },
      {
        "name": "Postcode.io",
        "website": "github.com/jabranr/postcodes-io",
        "description": "PHP library for postcodes.io API."
      },
      {
        "name": "Work Clock",
        "website": "work-clock.pages.dev",
        "description": "MacOS menu bar utility app written in Swift for remote work in different timezones."
      },
      {
        "name": "Google Maps API React Hook",
        "website": "npmjs.com/package/use-gmaps",
        "description": "Custom React hook to integrate Google Maps JavaScript SDK in React apps."
      },
      {
        "name": "Facebook API React Hook",
        "website": "npmjs.com/package/use-facebook",
        "description": "Custom React hook to integrate Facebook JavaScript SDK in React apps."
      },
      {
        "name": "Covidonation",
        "website": "covidonation.pages.dev",
        "description": "Directory of organizations helping during the COVID-19 pandemic."
      },
      {
        "name": "Covid19 Today",
        "website": "covid19-today.pages.dev",
        "description": "Daily updated figures for COVID-19 for every country and continent."
      },
      {
        "hidden": true,
        "name": "Socialmedia.js",
        "website": "github.com/jabranr/socialmedia",
        "description": "A JavaScript library that simplifies the social media integration into the web apps. It has a comprehensive documentation covering setup and usage for various supportive social media platforms."
      },
      {
        "hidden": true,
        "name": "Fetchwitter",
        "website": "github.com/jabranr/fetchwitter/",
        "description": "An easy-to-use PHP client to authenticate and consume Twitter API in web apps. Fetchwitter exposes a small and simple API to fetch Tweets and perform searches with terms such as a hashtag. It also has a WordPress plugin for easy integration into WordPress."
      },
      {
        "hidden": true,
        "name": "CSV Parser",
        "website": "github.com/jabranr/csv-parser/",
        "description": "A PHP client to parse CSV data from a file, stream, or string and convert into indexed or associative array format."
      },
      {
        "hidden": true,
        "name": "JS Memcache",
        "website": "github.com/jabranr/js-memcache",
        "description": "A lightweight JavaScript in-memory cache to store data for better performance by saving on network requests."
      }
    ]
  },
  "education": [
    {
      "order": 1,
      "type": "MSc Computer Science (Web Development)",
      "school": "Staffordshire University",
      "duration": "September 2010 — February 2013"
    },
    {
      "order": 2,
      "type": "Bachelor of Science in Information Technology",
      "school": "West London College of Business & Management Sciences",
      "duration": "May 2005 — August 2008",
      "hidden": true
    }
  ],
  "skillsDescription": "I have worked with or have a good understanding/familiarity with the following technologies, services and concepts.",
  "skills": [
    {
      "title": "Languages / Technologies",
      "tech": "HTML, CSS, JavaScript, TypeScript, PHP, SQL, Apache, Java, Ruby, Docker, AWS, Cloudflare, Google Cloud Platform (GCP), Firebase, Elastic, Swift, React Native, Linux/MacOS/Windows"
    },
    {
      "title": "Frameworks / Libraries",
      "tech": "ReactJS, NodeJS, Redux, Express, Remix, 11ty, jQuery, Backbone, Underscore/Lodash, Symfony, WordPress, Laravel, Bootstrap, Tailwind, Create React App"
    },
    {
      "title": "Workflow Concepts",
      "tech": "REST, TDD, BDD, Cucumber, Testing (Unit, Integration, End-to-End, Smoke, Stress, Performance), MVC, Agile, Waterfall, Kanban, Scrum, DRY, KISS, BEM, Progressive Enhancement & Graceful Degradation"
    },
    {
      "title": "Data / APIs / Web Services",
      "tech": "XML, JSON, JSONP, Google APIs, Facebook Graph API, Twitter API, Instagram API"
    },
    {
      "title": "Tools",
      "tech": "Jest, Enzyme, React Testing Library, Git, GitHub, GitHub Actions, BitBucket, Confluence, JIRA, Bamboo, Pipelines, Redis, Cypress, Playwright, Trello, NPM, Bower, Composer, Sass, Less, Jekyll, Webpack, Grunt, Yeoman, Functional/Reactive programming, Adobe Photoshop, Adobe Illustrator, VWO, AppDynamics, Miro, Figma, Salesforce, Invision, Branch, Postman, Swagger, Storybook, Lerna, Volta, Prettier, ESLint, Android Studio, XCode, Wrangler, Miniflare"
    }
  ],
  "volunteering": [
    "Contributed to Google's Map Maker project (2008-2013) to map unmapped areas, focusing on developing countries. Served in various community-leading positions, guiding a global community of mappers, setting regional mapping standards, organizing events, and leading training sessions.",
    "For more information, visit <a data-print=\"&bull; https://bit.ly/google-latlng\" class=\"print-link\" target=\"_blank\" href=\"https://bit.ly/google-latlng\">Google LatLng Blog</a>."
  ]
}