{
  "title": "Jabran Rafique",
  "contact": [
    "hello@jabran.me",
    "07983580025"
  ],
  "social": [
    "jabran.me",
    "<span class=\"text-[#666]\">github.com/</span>jabranr",
    "<span class=\"text-[#666]\">twitter.com/</span>jabranr"
  ],
  "intro": "I am software engineer with a passion for the web. I have an experience of more than seven years in developing scalable, performant, and interactive web applications with a keen eye for best practices and industry standards. <p class=\"hidden print:block\">I am passionate about the fascinating world of the web, its impact on human lives and the drive to make it accessible and performant for all. Therefore, I enjoy working on concepts and ideas that sustain best practices with early adoption of the latest technologies and workflows covering the entire software development life cycle.</p>",
  "employments": [
    {
      "order": 1,
      "role": "Front-End Tech Lead",
      "duration": "Jun 2018 — Present",
      "employer": "Rated People",
      "website": "ratedpeople.com",
      "experience": [
        "Mentor and manage a team of front-end developers, maintain regular team powwows, 1:1s and bi-annual performance reviews",
        "Discuss & challenge technical aspects to help with project scoping and architectural decisions with product/tech/design teams",
        "Knowledge sharing with peer programming and extensive code reviews to ensure best practices",
        "Help retire legacy PHP stack by moving to modern tech, primarily ReactJS, NodeJS, Remix, Cloudflare and AWS. Maintain an ongoing performance improvement roadmap",
        "Write robust, performant, and scalable code, unit and UI tests in a variety of languages, frameworks and tools, such as HTML, CSS, JavaScript, ReactJS, NodeJS, Ruby, Bash, Docker, WordPress, Elastic, Remix, Tailwind CSS, cloud and more",
        "Monitoring platform health using SaaS tools such as AppDynamics and Heap",
        "Assist product and CRM teams with users testing and AB testing using tools such as Cloudflare Workers, VWO and SEOClarity"
      ]
    },
    {
      "order": 2,
      "role": "Front-End Web Developer",
      "duration": "Nov 2015 — May 2018",
      "employer": "Rated People",
      "website": "ratedpeople.com",
      "experience": [
        "Involved with front-end stack migration to the cloud (AWS)",
        "Involved with platform key rebrand in 2016",
        "Involved with optimising existing PHP Symfony micro-apps to be performant and cloud-ready",
        "Helped with upgrading the tools chain used in the front-end eco-system and modernised the stack by replacing the obsolete technologies",
        "Involved in developing a new Symfony app to fully automate the customer signups flow, including fraud and risk assessment, and validations externally and internally APIs to reduce overhead for sales and fraud teams",
        "Accustomed with NodeJS, ReactJS and many other relevant modern tools to develop a REST API layer to support future client-side only apps with robust authentication flow"
      ]
    },
    {
      "order": 3,
      "role": "Lead Web Developer",
      "duration": "May 2013 — Oct 2015",
      "employer": "Influence Digital",
      "website": "influence.digital",
      "experience": [
        "Manage development cycles, timelines, roadmaps, quality of code and documentation for apps and websites",
        "Monitor and maintain best practices. Provide guidance and examples to adopt the latest technology trends to improve the development workflow",
        "Supervise junior developers and freelancers. Provide consultation and analysis to design lead, report and collaborate with the project manager to maintain development flow sprints",
        "Maintain in-house developed social media application development frameworks",
        "Build prototypes based on ideas for social campaigns",
        "Develop and maintain LAM(PHP) stack based MVC framework and boilerplates for in-house custom web apps development",
        "Clients included Thomas Cook Group, Hotels4U, Marco Aldany UK, RedStripe, Arcadia Group, Intec Digital, Modestep, Nordic Games, Hobbs, ShopStyle, Outfit Fashion, WeAreFSTVL, Rise Festival, OnBlackHeath, Pathé"
      ]
    },
    {
      "order": 4,
      "role": "Social Web Developer",
      "duration": "Feb 2013 — Apr 2013",
      "employer": "Influence Digital ex. United Agency",
      "website": "united-agency.co.uk",
      "experience": [
        "Involved with development of standalone web apps for social media and websites in a small team",
        "Enhanced the development workflow from a basic structure to a more stable, secure and reusable structure by introducing and encouraging the use of the latest technologies, best practices and workflows",
        "Developing social web apps for the Facebook platform",
        "Integrating third-party APIs (Facebook, Google Maps, Instagram) to build interactive apps engaging a vast social media audience ",
        "Help infram team to restructure the servers’ setup and development workflow for better management",
        "Clients included mostly from retail, travel and music i.e. Arcadia Group, Thomas Cook, WeAreFSTVL and Lisa Stansfield"
      ]
    }
  ],
  "freelancing": [
    {
      "order": 1,
      "role": "Developer",
      "duration": "Sep 2013 — Aug 2014",
      "employer": "Multinet",
      "website": "multinet.com.pk",
      "description": "I developed a Role-Based Access Control (RBAC) platform in LAM(PHP) stack to monitor countrywide fibre-optic operations internally. The monitoring platform extensively used Google Maps API underneath with drawings API on top of it to add lines and station data to showcase service status in real-time. The source of data was the emails generated by the stations on service updates."
    },
    {
      "order": 2,
      "role": "Developer",
      "duration": "May 2012 — Aug 2012",
      "employer": "JMK Logistics",
      "website": "jmklogistics.com",
      "description": "I developed the website, designed branding and an internal logistics consignment system using LAM(PHP) stack that had helped me learn advance aspects of web development."
    },
    {
      "order": 3,
      "role": "Developer",
      "duration": "Feb 2011 — Jan 2012",
      "employer": "Aerologic Limited",
      "website": "aerologic-ltd.com",
      "description": "I designed the wireframes and prototypes. Based on these designs, I developed the website and inventory UI for electro-mechanical material related to the aerospace industry using open-source technologies LAM(PHP)."
    }
  ],
  "projectsDescription": "I develop apps based on personal ideas and interests in my spare time. Most of my projects are open-sourced and the code is hosted at GitHub. Some of these projects are:",
  "projects": [
    {
      "name": "Childcare Vouchers",
      "website": "childcare-vouchers.uk",
      "description": "A directory of businesses accepting childcare vouchers as a method of payment."
    },
    {
      "name": "Covidonation",
      "website": "covidonation.pages.dev",
      "description": "A directory of different organisations, charities and individuals who are working around the world to help the vulnerable during the pandemic of Coronavirus (COVID-19)."
    },
    {
      "name": "Covid19 Today",
      "website": "covid19-today.pages.dev",
      "description": "Daily updated figures for COVID19 for every country and continent"
    },
    {
      "name": "Reason to Follow",
      "website": "jabran.me/reason-to-follow/",
      "description": "A browser extension that helps you remember the reason to follow an account on social platforms."
    },
    {
      "name": "Work Clock",
      "website": "jabran.me/work-clock/",
      "description": "A MacOS menu bar utility app I developed to help myself while working remotely from different timezones. The app is written in Swift."
    },
    {
      "name": "Google Maps API React Hook",
      "website": "github.com/jabranr/use-gmaps",
      "description": "A custom React hook to integrate Google Maps JavaScript SDK in React apps."
    },
    {
      "name": "Facebook API React Hook",
      "website": "github.com/jabranr/use-facebook",
      "description": "A custom React hook to integrate Facebook JavaScript SDK in React apps."
    },
    {
      "name": "Postcode.io PHP SDK",
      "website": "github.com/jabranr/postcodes-io",
      "description": "PostcodesIO is a PHP library for postcodes.io API. It provides support to most recent versions of PHP and has robust unit testing suite to report any changes in base API or otherwise."
    },
    {
      "name": "Guess Where",
      "website": "jabran.me/guess-where/",
      "description": "A geo quiz app built with HTML, CSS, JavaScript, and Google Maps API. It is inspired from an image-based quiz by The Independent."
    },
    {
      "name": "Socialmedia.js",
      "website": "github.com/jabranr/socialmedia",
      "description": "A JavaScript library that simplifies the social media integration into the web apps. It has a comprehensive documentation covering setup and usage for various supportive social media platforms."
    },
    {
      "name": "Fetchwitter",
      "website": "github.com/jabranr/fetchwitter/",
      "description": "An easy-to-use PHP client to authenticate and consume Twitter API in web apps. Fetchwitter exposes a small and simple API to fetch Tweets and perform searches with terms such as a hashtag. It also has a WordPress plugin for easy integration into WordPress."
    },
    {
      "name": "CSV Parser",
      "website": "github.com/jabranr/csv-parser/",
      "description": "A PHP client to parse CSV data from a file, stream, or string and convert into indexed or associative array format."
    },
    {
      "name": "JS Memcache",
      "website": "github.com/jabranr/js-memcache",
      "description": "A lightweight JavaScript in-memory cache to store data for better performance by saving on network requests."
    }
  ],
  "education": [
    {
      "order": 1,
      "type": "MSc Computer Science (Web Development)",
      "school": "Staffordshire University",
      "duration": "September 2010 — February 2013"
    },
    {
      "order": 2,
      "type": "Bachelor of Science in Information Technology",
      "school": "West London College of Business & Management Sciences",
      "duration": "May 2005 — August 2008"
    }
  ],
  "skillsDescription": "I have worked with or have a good understanding/familiarity with the following technologies, services and concepts.",
  "skills": [
    {
      "title": "Languages / Technologies",
      "tech": "HTML, CSS, JavaScript, TypeScript, PHP, SQL, Apache, Java, Ruby, Docker, AWS, Cloudflare, Google Cloud Platform (GCP), Firebase, Elastic, Swift, React Native, Linux/MacOS/Windows"
    },
    {
      "title": "Frameworks / Libraries",
      "tech": "ReactJS, NodeJS, Redux, Express, Remix, 11ty, jQuery, Backbone, Underscore/Lodash, Symfony, WordPress, Laravel, Bootstrap, Tailwind, Create React App"
    },
    {
      "title": "Data / APIs / Web Services",
      "tech": "XML, JSON, JSONP, Google APIs, Facebook Graph API, Twitter API, Instagram API"
    },
    {
      "title": "Workflow Concepts",
      "tech": "REST, TDD, BDD, Cucumber, Testing (Unit, Integration, End-to-End, Smoke, Stress, Performance), MVC, Agile, Waterfall, Kanban, Scrum, DRY, KISS, BEM, Progressive Enhancement & Graceful Degradation"
    },
    {
      "title": "Tools",
      "tech": "Jest, Enzyme, React Testing Library, Git, GitHub, GitHub Actions, BitBucket, Confluence, JIRA, Bamboo, Pipelines, Trello, NPM, Bower, Composer, Sass, Less, Jekyll, Webpack, Grunt, Yeoman, Functional/Reactive programming, Adobe Photoshop, Adobe Illustrator, VWO, AppDynamics, Miro, Figma, Salesforce, Invision, Branch, Postman, Swagger, Storybook, Lerna, Volta, Prettier, ESLint, Android Studio, XCode, Wrangler, Miniflare"
    }
  ],
  "volunteering": [
    "During free time, I like to contribute to social work that benefits large communities. I worked between 2008 and 2013 with Google on their Map Maker project to map the unmapped areas of the world — especially developing countries.",
    "Since then, I have served in different community leading positions such as Power Mapper, Advocate and as a Regional Lead. It involves working with global community of mappers, guiding them, setting regional standards of mapping, organizing, and speaking at events and leading training sessions around the globe. More information is available on <a class=\"print-link\" target=\"_blank\" href=\"https://bit.ly/google-latlng\">Google LatLng Blog</a>"
  ],
  "interests": [
    "Travelling, Cooking, Open-Source development, Cartography, Books, Cricket"
  ]
}
